# FailureDefinitionId Properties

---
The FailureDefinitionId type exposes the following members.
| Name| Description
---|---|---
| Guid|  The Guid of GUID-based enum object. (Inherited from GuidEnum)
Top
#### Reference
FailureDefinitionId Class
Autodesk.Revit.DB Namespace